org/_posts/2016-10-16-favourite-quotes-galois.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEGIN_HTML
---
layout: post
title: "Evariste Galois 1811 - 1832"
date: 2016-10-16
comments: true
quotes: true
tags: quotes
excerpt: Favourite quotes from Evariste Galois
---
#+END_HTML

- Unfortunately what is little recognized is that the most worthwhile
  scientific books are those in which the author clearly indicates
  what he does not know; for an author most hurts his readers by
  concealing difficulties
