_posts/2016-10-16-favourite-quotes-galois.html
<div class="HTML">
<p>
&#x2014;
layout: post
title: "Evariste Galois 1811 - 1832"
date: 2016-10-16
comments: true
quotes: true
tags: quotes
excerpt: Favourite quotes from Evariste Galois
&#x2014;
</p>

</div>

<ul class="org-ul">
<li>Unfortunately what is little recognized is that the most worthwhile
scientific books are those in which the author clearly indicates
what he does not know; for an author most hurts his readers by
concealing difficulties</li>
</ul>
